mdw-workflow/assets/com/centurylink/mdw/tests/cucumber/GetEmployeeSoap.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:tns="http://mdw.centurylink.com/serviceTypes">
  <env:Header>
    <trans:requestId xmlns:trans="http://www.centurylink.com/transaction/">12345678</trans:requestId>
  </env:Header>                    
  <env:Body>
    <tns:GetEmployee>
      <tns:workstationId>dxoakes</tns:workstationId>
    </tns:GetEmployee>
  </env:Body>
</env:Envelope>